---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService
source: html/e72d8ea8-98ee-9976-f514-fbe38f1d7182.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService Property

The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI.
 To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer .

## Syntax (C#)
```csharp
public static ExternalServiceId DuctFittingAndAccessoryPressureDropUIService { get; }
```